src/Documents/Вложение/Вложение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вложение</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВложения</name>
    <type>
      <types>EnumRef.ВидВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Файлы/Файлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Файлы</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Папка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>CatalogRef.КлючиСтрок</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/Вложение/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение  ();		
	КонецЕсли;
	установитьЗаголовок  ();
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	ХранениеФайлов = Константы.ХранениеФайлов.Получить ();
	
КонецПроцедуры

&НаСервере
Процедура установитьЗаголовок ()
	
	с = Документы.Вложение.ПолучитьПредставлениеПоВиду ( Объект.ВидВложения );
	Если ( Объект.Ссылка.Пустая () ) Тогда
		Заголовок = с + " (создание)";
	Иначе
		Заголовок = с + " от " + Формат ( Объект.Дата, "ДФ=dd.MM.yyyy" ) + " номер " + Объект.Номер;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии ( Отказ )
	
	// код ...
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВложение ( Команда )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		ПоказатьВопрос ( Новый ОписаниеОповещения ( "ВопросЗаписать", ЭтотОбъект ), "Документ еще не записан. Записать?", РежимДиалогаВопрос.ДаНет );
	Иначе
		выбратьФайлы ();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаписать ( Ответ, Парамы ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		Записать ();
		выбратьФайлы ();
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура выбратьФайлы ()
	
	оповещение = Новый ОписаниеОповещения ( "ВыборФайлов", ЭтотОбъект );
	РаботаСФайлами.ВыбратьФайлы ( оповещение );	
			
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлов ( Данные, Парамы ) Экспорт
	
	Если ( Данные = Неопределено ) Тогда
		Возврат;
	Иначе
		добавитьВложения ( Данные.Файлы );
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура добавитьВложения ( Файлы )
	
	Для Каждого п Из Файлы Цикл
		новая = Объект.Файлы.Добавить ();
		новая.Описание = п.Имя;
		м = Объект.Файлы.Выгрузить ( , "КлючСтроки" );
		новая.КлючСтроки = получитьКлюч ( м );
		записатьФайлВРегистр ( п, Объект.Ссылка, новая.КлючСтроки );	
	КонецЦикла;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьКлюч ( Ключи )
	
	Возврат Справочники.КлючиСтрок.ПолучитьНовыйКлюч ( Ключи );

КонецФункции

&НаСервереБезКонтекста
Процедура записатьФайлВРегистр ( Данные, Объект, КлючСтроки )
	
	п = Новый Структура ();
	п.Вставить ( "Объект", Объект );
	п.Вставить ( "КлючСтроки", КлючСтроки );
	п.Вставить ( "Дата", ТекущаяДатаСеанса () );
	п.Вставить ( "Размер", Данные.Размер );
	п.Вставить ( "Автор", ПараметрыСеанса.ТекущийПользователь );
	п.Вставить ( "Папка", "" );
	п.Вставить ( "ИмяФайла", Данные.Имя );
	п.Вставить ( "Расширение", Данные.Расширение );
	п.Вставить ( "Адрес", Данные.Адрес );
	РегистрыСведений.Файлы.ЗаписатьФайл ( п );
	
КонецПроцедуры
